Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ0512EFF144.PIC
      <edc:SFRDef edc:_addr="0x1F8E2004" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1XCON2" edc:desc="SQI XIP Control Register 2" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000010100000" edc:name="SQI1XCON2" edc:nzwidth="32" edc:por="--------------------000010100000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODECODE" edc:desc="These bits contain the 8-bit code value for the mode bits." edc:mask="0xff" edc:name="MODECODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="MODEBYTES" edc:desc="Mode Byte Cycle Enable bits" edc:mask="0x3" edc:name="MODEBYTES" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Three cycles" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two cycles" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One cycle" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero cycles" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select bits" edc:mask="0x3" edc:name="DEVSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Device 1 is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Device 0 is selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2008" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="------nnn-nnnnnnn--n-nn---nnnnnn" edc:cname="SQI1CFG" edc:desc="SQI Configuration Register" edc:impl="0x3bf977f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000-0000001--0-00---000000" edc:name="SQI1CFG" edc:nzwidth="32" edc:por="------000-0000001--0-00---000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Mode Select bits" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="XIP mode is selected (when this mode is entered, the module behaves as if executing in place (XIP),but uses the register data to control timing)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="DMA mode is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="CPU mode is selected (the module is controlled by the CPU in PIO mode. This mode is entered whenleaving Boot or XIP mode)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase Select bit" edc:mask="0x1" edc:name="CPHA" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the start of the first data bit" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the middle of the first data bit" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity Select bit" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Active-low SQICLK (SQICLK high is the Idle state)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Active-high SQICLK (SQICLK low is the Idle state)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LSBF" edc:desc="Data Format Select bit" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="LSB is send or received first" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="MSB is sent or received first" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WP" edc:desc="In Single Lane or Dual Lane mode, this bit is used to drive the SQID2 pin, which can be used with deviceswith a write-protect pin. The meaning of the values for this bit will depend on the device to which SQID2 isconnected." edc:mask="0x1" edc:name="WP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="Hold bit. In Single Lane or Dual Lane mode, this bit is used to drive the SQID3 pin, which can be used for devices with a HOLD input pin. The meaning of the values for this bit will depend on the device to which SQID3 is connected." edc:mask="0x1" edc:name="HOLD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BURSTEN" edc:desc="Burst Configuration bit" edc:mask="0x1" edc:name="BURSTEN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Burst is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Burst is not enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="Software Reset Select bit" edc:mask="0x1" edc:name="RESET" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXBUFRST" edc:desc="Transmit Buffer Reset bit" edc:mask="0x1" edc:name="TXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the transmit buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXBUFRST" edc:desc="Receive Buffer Reset bit" edc:mask="0x1" edc:name="RXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the receive buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONBUFRST" edc:desc="Control Buffer Reset bit" edc:mask="0x1" edc:name="CONBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated, clearing the control buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:desc="Data Output Enable bits" edc:mask="0x3" edc:name="DATAEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="SQID3-SQID0 outputs are enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="SQID1 and SQID0 data outputs are enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQID0 data output is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SQIEN" edc:desc="SQI Enable bit" edc:mask="0x1" edc:name="SQIEN" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSEN" edc:desc="Chip Select Output Enable bits" edc:mask="0x3" edc:name="CSEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are used" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 1 is used (Chip Select 0 is not used)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 is used (Chip Select 1 is not used)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are not used" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E200C" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1CON" edc:desc="SQI Control Register" edc:impl="0x1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0000000000000000000000000" edc:name="SQI1CON" edc:nzwidth="32" edc:por="-------0000000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRXCOUNT" edc:desc="" edc:mask="0xffff" edc:name="TXRXCOUNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="CMDINIT" edc:desc="" edc:mask="0x3" edc:name="CMDINIT" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="LANEMODE" edc:desc="" edc:mask="0x3" edc:name="LANEMODE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="SQI Device Select bits" edc:mask="0x3" edc:name="DEVSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Select Device 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Select Device 0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DASSERT" edc:desc="Chip Select Assert bit" edc:mask="0x1" edc:name="DASSERT" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Chip Select is deasserted after transmission or reception of the specified number of bytes" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select is not deasserted after transmission or reception of the specified number of bytes" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="Double Data Rate Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Set the SQI transfers to DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Set the SQI transfers to SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCHECK" edc:desc="Flash Status Check bit" edc:mask="0x1" edc:name="SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status of the Flash" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status of the Flash" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2010" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="-------------nnnnnnnnnnn------rn" edc:cname="SQI1CLKCON" edc:desc="SQI Clock Control Register" edc:impl="0x7ff03" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------00000000000------00" edc:name="SQI1CLKCON" edc:nzwidth="32" edc:por="-------------00000000000------00" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Tsqi Clock Enable Select bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Enable the SQI clock (Tsqi)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Disable the SQI clock (Tsqi)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STABLE" edc:desc="Tsqi Clock Stable Select bit" edc:mask="0x1" edc:name="STABLE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Tsqi clock is stable" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Tsqi clock is not stable" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="SQI Clock Tsqi Frequency Select bits" edc:mask="0x7ff" edc:name="CLKDIV" edc:nzwidth="11">
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 2048" edc:when="(field &amp; 0x3ff) == 0x200"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 1024" edc:when="(field &amp; 0x3ff) == 0x100"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 512" edc:when="(field &amp; 0x3ff) == 0x80"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 256" edc:when="(field &amp; 0x3ff) == 0x40"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 128" edc:when="(field &amp; 0x3ff) == 0x20"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 64" edc:when="(field &amp; 0x3ff) == 0x10"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 32" edc:when="(field &amp; 0x3ff) == 0x8"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 16" edc:when="(field &amp; 0x3ff) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 8" edc:when="(field &amp; 0x3ff) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Base clock Tbc is divided by 4" edc:when="(field &amp; 0x3ff) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Base clock Tbc is divided by 2" edc:when="(field &amp; 0x3ff) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2014" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="------------------nnnnnn--nnnnnn" edc:cname="SQI1CMDTHR" edc:desc="SQI Command Threshold Register" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="SQI1CMDTHR" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCMDTHR" edc:desc="Receive Command Threshold bits. In receive initiation mode, the SQI module attempts to perform receive operations to fetch these number of bytes in the receive buffer. If software performs any reads, hardware would initiate a receive transfer to make the receive buffer count equal to the value in these bits. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="RXCMDTHR" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TXCMDTHR" edc:desc="Transmit Command Threshold bits. Number of bytes in TX buffer at which to perform transmit operation. Should usually be '1' for normal Flash commands, and set to a higher value for page programming. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="TXCMDTHR" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2018" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="------------------nnnnnn--nnnnnn" edc:cname="SQI1INTTHR" edc:desc="SQI Interrupt Threshold Register" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="SQI1INTTHR" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINTTHR" edc:desc="Receive Interrupt Threshold bits. A receive interrupt is set when the buffer count is larger than or equal to this value. RXINTTHR is the number of bytes in the receive buffer. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="RXINTTHR" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TXINTTHR" edc:desc="Transmit Interrupt Threshold bits. A transmit interrupt is set when the transmit buffer has more space than these number of bytes. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="TXINTTHR" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E201C" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1INTEN" edc:desc="SQI Interrupt Enable Register" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="SQI1INTEN" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="Transmit Buffer Empty Interrupt Enable bit" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXFULLIE" edc:desc="Transmit Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="TXFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTHRIE" edc:desc="Transmit Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="TXTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXEMPTYIE" edc:desc="Receive Buffer Empty Interrupt Enabled bit" edc:mask="0x1" edc:name="RXEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="Receive Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXTHRIE" edc:desc="Receive Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="RXTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONFULLIE" edc:desc="Control Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="CONFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONEMPTYIE" edc:desc="Control Buffer Empty Interrupt Enabled bit" edc:mask="0x1" edc:name="CONEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTHRIE" edc:desc="Control Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="CONTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDDONEIE" edc:desc="DMA Buffer Descriptor Done Interrupt Enable bit" edc:mask="0x1" edc:name="BDDONEIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PKTCOMPIE" edc:desc="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" edc:mask="0x1" edc:name="PKTCOMPIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAEIE" edc:desc="DMA Bus Error Interrupt Enable bit" edc:mask="0x1" edc:name="DMAEIE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
