Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ0512EFF144.PIC
      <edc:SFRDef edc:_addr="0x1F8E2064" edc:_begin="0x40" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="2" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON3" edc:desc="SQI XIP Control Register 3" edc:impl="0x1fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000000000000000000000000000" edc:name="SQI1XCON3" edc:nzwidth="32" edc:por="---00000000000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT1CMD1" edc:desc="Flash Initialization Command 1 bits. First command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD2" edc:desc="Flash Initialization Command 2 bits. Second command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD3" edc:desc="Flash Initialization Command 3 bits. Third command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1TYPE" edc:desc="Flash Initialization 1 Command Type bits" edc:mask="0x3" edc:name="INIT1TYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commadns are sent in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1COUNT" edc:desc="Flash Initialization 1 Command Count bits" edc:mask="0x3" edc:name="INIT1COUNT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="INIT1CMD3, INIT1CMD2, and INIT1CMD3 are sent." edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 and INIT1CMD2 are sent, but INIT1CMD3 is still pending." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 is sent, but INIT1CMD2 and INIT1CMD3 are still pending." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No commands are sent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1SCHECK" edc:desc="Flash Initialization 1 Command Status Check bit" edc:mask="0x1" edc:name="INIT1SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status after executing the INIT1 command" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2068" edc:_begin="0x40" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="2" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON4" edc:desc="SQI XIP Control Register 4" edc:impl="0x1fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000000000000000000000000000" edc:name="SQI1XCON4" edc:nzwidth="32" edc:por="---00000000000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT2CMD1" edc:desc="Flash Initialization Command 1 bits. First command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2CMD2" edc:desc="Flash Initialization Command 2 bits. Second command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2CMD3" edc:desc="Flash Initialization Command 3 bits. Third command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2TYPE" edc:desc="Flash Initialization 2 Command Type bits" edc:mask="0x3" edc:name="INIT2TYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT2COUNT" edc:desc="Flash Initialization 2 Command Count bits" edc:mask="0x3" edc:name="INIT2COUNT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1, INIT2CMD2, and INIT2CMD3 are sent" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1 and INIT2CMD2 are sent, but INIT2CMD3 is still pending" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1 is sent, but INIT2CMD2 and INIT2CMD3 are still pending" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No commands are sent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT2SCHECK" edc:desc="Flash Initialization 2 Command Status Check bit" edc:mask="0x1" edc:name="INIT2SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status after executing the INIT2 command" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E206C" edc:offset="3988"/>
      <edc:SFRDef edc:_addr="0x1F8E3000" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="--------rrrrrrrrnnnrnnnn-nnnnnnn" edc:cname="USBCSR0" edc:desc="" edc:impl="0xffff7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0000000000000010-0000000" edc:name="USBCSR0" edc:nzwidth="32" edc:por="--------0000000000000010-0000000" ltx:baseofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FUNC" edc:desc="" edc:mask="0x7f" edc:name="FUNC" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SUSPEN" edc:desc="" edc:mask="0x1" edc:name="SUSPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SUSPMODE" edc:desc="" edc:mask="0x1" edc:name="SUSPMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESUME" edc:desc="" edc:mask="0x1" edc:name="RESUME" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="" edc:mask="0x1" edc:name="RESET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSMODE" edc:desc="" edc:mask="0x1" edc:name="HSMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="" edc:mask="0x1" edc:name="HSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOFTCONN" edc:desc="" edc:mask="0x1" edc:name="SOFTCONN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ISOUPD" edc:desc="" edc:mask="0x1" edc:name="ISOUPD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP0IF" edc:desc="" edc:mask="0x1" edc:name="EP0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP1TXIF" edc:desc="" edc:mask="0x1" edc:name="EP1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2TXIF" edc:desc="" edc:mask="0x1" edc:name="EP2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3TXIF" edc:desc="" edc:mask="0x1" edc:name="EP3TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4TXIF" edc:desc="" edc:mask="0x1" edc:name="EP4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5TXIF" edc:desc="" edc:mask="0x1" edc:name="EP5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6TXIF" edc:desc="" edc:mask="0x1" edc:name="EP6TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7TXIF" edc:desc="" edc:mask="0x1" edc:name="EP7TXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3004" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="--------rrrrrrr---------nnnnnnnn" edc:cname="USBCSR1" edc:desc="" edc:impl="0xfe00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0000000---------11111111" edc:name="USBCSR1" edc:nzwidth="32" edc:por="--------0000000---------11111111" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EP1RXIF" edc:desc="" edc:mask="0x1" edc:name="EP1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2RXIF" edc:desc="" edc:mask="0x1" edc:name="EP2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3RXIF" edc:desc="" edc:mask="0x1" edc:name="EP3RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4RXIF" edc:desc="" edc:mask="0x1" edc:name="EP4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5RXIF" edc:desc="" edc:mask="0x1" edc:name="EP5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6RXIF" edc:desc="" edc:mask="0x1" edc:name="EP6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7RXIF" edc:desc="" edc:mask="0x1" edc:name="EP7RXIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="EP0IE" edc:desc="" edc:mask="0x1" edc:name="EP0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP1TXIE" edc:desc="" edc:mask="0x1" edc:name="EP1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2TXIE" edc:desc="" edc:mask="0x1" edc:name="EP2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3TXIE" edc:desc="" edc:mask="0x1" edc:name="EP3TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4TXIE" edc:desc="" edc:mask="0x1" edc:name="EP4TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5TXIE" edc:desc="" edc:mask="0x1" edc:name="EP5TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6TXIE" edc:desc="" edc:mask="0x1" edc:name="EP6TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7TXIE" edc:desc="" edc:mask="0x1" edc:name="EP7TXIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
